app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "teacher", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "高级软件工程"], ["teacher", "罗挺坚"], ["created_at", "2017-11-08 02:50:02.432971"], ["updated_at", "2017-11-08 02:50:02.432971"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])